# Pandas

- 구조화된 데이터의 처리를 지원하는 Python 라이브러리
- 고성능 Array 계산 라이브러리인 Numpy와 통합하여, "스프레드시트" 처리 등을 제공
- 인덱싱, 연산용 함수, 전처리 함수 등을 제공함

In [3]:
import pandas as pd
import numpy as np

In [4]:
data_url = "https://archive.ics.uci.edu/ml/machine-learning-databases/housing/housing.data" #data url
df_data = pd.read_csv(data_url, sep='\s+', header = None)

In [5]:
df_data.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2

## Series
- DataFrame 중 하나의 Column에 해당하는 데이터의 모음 Object

In [6]:
#Series
example_obj = pd.Series(data = [1, 2, 3, 4, 5])
example_obj

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [7]:
# index 인자에 리스트를 지정하여 이름을 변경할 수 있다., 데이터와 크기가 동일해야한다
data = [1, 2, 3, 4, 5]
index_name = ['a', 'b', 'c', 'd', 'e']

ex_obj = pd.Series(data = data, index = index_name)
ex_obj

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [8]:
# dict type의 데이터도 Series로 처리가능
dict_data = {"a" : 1, 'b' : 2, 'c':3, 'd':4, 'e':5}
ex_obj = pd.Series(dict_data, dtype = np.float32, name = "example_data")
ex_obj

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
Name: example_data, dtype: float32

### Using index

In [9]:
ex_obj['a']

1.0

In [10]:
ex_obj['a'] = 21
ex_obj

a    21.0
b     2.0
c     3.0
d     4.0
e     5.0
Name: example_data, dtype: float32

In [11]:
ex_obj.values

array([21.,  2.,  3.,  4.,  5.], dtype=float32)

In [12]:
ex_obj.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [13]:
ex_obj.name = 'AAAAAA'
ex_obj

a    21.0
b     2.0
c     3.0
d     4.0
e     5.0
Name: AAAAAA, dtype: float32

In [14]:
ex_obj.index_name = "alpha"
ex_obj

a    21.0
b     2.0
c     3.0
d     4.0
e     5.0
Name: AAAAAA, dtype: float32

In [15]:
# index의 길이가 더 길 경우 데이터가 없는 부분은 NaN 처리된다.
dict_data = {"a" : 1, 'b' : 2, 'c':3, 'd':4, 'e':5}
index_name = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h']
ex_obj = pd.Series(dict_data, index=index_name)
ex_obj

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
f    NaN
g    NaN
h    NaN
dtype: float64

## DataFrame
- Data 전체를 포함하는 Object
- like Numpy Array
- Series를 모아서 만든 Data Table --> 기본 2차원

In [16]:
raw_data = {'first_name' : ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
           'last_name'  : ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'],
           'age' : [42, 52, 36, 24, 73],
           'city' : ["San Fancisco", "Baltmore", "Miami", "Douglas", "Boston"]}

df = pd.DataFrame(raw_data, columns = ["first_name", "last_name", "age", "city"])
df

  first_name last_name  age          city
0      Jason    Miller   42  San Fancisco
1      Molly  Jacobson   52      Baltmore
2       Tina       Ali   36         Miami
3       Jake    Milner   24       Douglas
4        Amy     Cooze   73        Boston

In [17]:
# 부분적 데이터로 DF 생성
pd.DataFrame(raw_data, columns = ['Age', 'city'])

   Age          city
0  NaN  San Fancisco
1  NaN      Baltmore
2  NaN         Miami
3  NaN       Douglas
4  NaN        Boston

In [18]:
# data에는 존재하지않는 새로운 column
pd.DataFrame(raw_data, columns = ["first_name", "last_name", "age", "city", 'hihi'])

  first_name last_name  age          city hihi
0      Jason    Miller   42  San Fancisco  NaN
1      Molly  Jacobson   52      Baltmore  NaN
2       Tina       Ali   36         Miami  NaN
3       Jake    Milner   24       Douglas  NaN
4        Amy     Cooze   73        Boston  NaN

In [19]:
# column 선택 - Series 추출
df.first_name

0    Jason
1    Molly
2     Tina
3     Jake
4      Amy
Name: first_name, dtype: object

In [20]:
df['first_name']

0    Jason
1    Molly
2     Tina
3     Jake
4      Amy
Name: first_name, dtype: object

In [21]:
type(df.first_name)

pandas.core.series.Series

In [22]:
# data 추출 - .loc, .iloc
df.loc[1]

first_name       Molly
last_name     Jacobson
age                 52
city          Baltmore
Name: 1, dtype: object

In [23]:
df.age.iloc[2:4]

2    36
3    24
Name: age, dtype: int64

In [24]:
# .loc는 index name, .iloc는 index number
s = pd.Series(np.NaN, index=[49, 48, 47, 46, 45, 0, 1, 2, 3, 4])
s.loc[:3] #index의 이름이 3인 data까지 출력

49   NaN
48   NaN
47   NaN
46   NaN
45   NaN
0    NaN
1    NaN
2    NaN
3    NaN
dtype: float64

In [25]:
s.iloc[:3] #index Number가 3인 data까지 출력

49   NaN
48   NaN
47   NaN
dtype: float64

In [26]:
# column에 새로운 데이터 할당
df["debt"] = df.age > 40
df

  first_name last_name  age          city   debt
0      Jason    Miller   42  San Fancisco   True
1      Molly  Jacobson   52      Baltmore   True
2       Tina       Ali   36         Miami  False
3       Jake    Milner   24       Douglas  False
4        Amy     Cooze   73        Boston   True

In [27]:
#Tranpose
df.T

                       0         1      2        3       4
first_name         Jason     Molly   Tina     Jake     Amy
last_name         Miller  Jacobson    Ali   Milner   Cooze
age                   42        52     36       24      73
city        San Fancisco  Baltmore  Miami  Douglas  Boston
debt                True      True  False    False    True

In [28]:
# 값 출력
df.values

array([['Jason', 'Miller', 42, 'San Fancisco', True],
       ['Molly', 'Jacobson', 52, 'Baltmore', True],
       ['Tina', 'Ali', 36, 'Miami', False],
       ['Jake', 'Milner', 24, 'Douglas', False],
       ['Amy', 'Cooze', 73, 'Boston', True]], dtype=object)

In [29]:
# csv 파일로 저장
df.to_csv()

',first_name,last_name,age,city,debt\n0,Jason,Miller,42,San Fancisco,True\n1,Molly,Jacobson,52,Baltmore,True\n2,Tina,Ali,36,Miami,False\n3,Jake,Milner,24,Douglas,False\n4,Amy,Cooze,73,Boston,True\n'

In [30]:
# column 삭제
del df['debt']

In [31]:
df

  first_name last_name  age          city
0      Jason    Miller   42  San Fancisco
1      Molly  Jacobson   52      Baltmore
2       Tina       Ali   36         Miami
3       Jake    Milner   24       Douglas
4        Amy     Cooze   73        Boston

In [32]:
# DataFrame with nested dict
pop = {'Nevada' : {2001:2.4, 2002:2.9},
      'Ohio' : {2000:1.5, 2001:1.7, 2002:3.6}}

pd.DataFrame(pop)

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

## Selection & Drop

In [33]:
df = pd.read_excel("./data/excel-comp-data.xlsx")
df.head()

,account,name,street,city,state,postal-code,Jan,Feb,Mar
0,211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
3,109996,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,121213,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

### data selection with index number and column names

In [34]:
df['account'].head(3)

0    211829
1    320563
2    648336
Name: account, dtype: int64

In [35]:
df[['account', 'name','city']].head()

   account                         name             city
0   211829   Kerluke, Koepp and Hilpert       New Jaycob
1   320563               Walter-Trantow    Port Khadijah
2   648336   Bashirian, Kunde and Price   New Lilianland
3   109996  D'Amore, Gleichner and Bode       Hyattburgh
4   121213                Bauch-Goldner  Shanahanchester

In [36]:
df[:3]

,account,name,street,city,state,postal-code,Jan,Feb,Mar
0,211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000

In [37]:
df['account'][:3] # same as .head(3)

0    211829
1    320563
2    648336
Name: account, dtype: int64

In [38]:
df['account'][[0, 10, 12]]

0     211829
10    214098
12    242368
Name: account, dtype: int64

In [39]:
df['account'][df['account'] > 25000].head()

0    211829
1    320563
2    648336
3    109996
4    121213
Name: account, dtype: int64

### change index

In [40]:
df.index = df.account
df

,account,name,street,city,state,postal-code,Jan,Feb,Mar
account,,,,,,,,,
211829,211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
320563,320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
648336,648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
109996,109996,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
121213,121213,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000
132971,132971,"Williamson, Schumm and Hettinger",89403 Casimer Spring,Jeremieburgh,Arkansas,62785,150000,120000,35000
145068,145068,Casper LLC,340 Consuela Bridge Apt. 400,Lake Gabriellaton,Mississipi,18008,62000,120000,70000
205217,205217,Kovacek-Johnston,91971 Cronin Vista Suite 601,Deronville,RhodeIsland,53461,145000,95000,35000
209744,209744,Champlin-Morar,26739 Grant Lock,Lake Juliannton,Pennsylvania,64415,70000,95000,35000
212303,212303,Gerhold-Maggio,366 Maggio Grove Apt. 998,North Ras,Idaho,46308,70000,120000,35000
214098,214098,"Goodwin, Homenick and Jerde",649 Cierra Forks Apt. 078,Rosaberg,Tenessee,47743,45000,120000,55000
231907,231907,Hahn-Moore,18115 Olivine Throughway,Norbertomouth,NorthDakota,31415,150000,10000,162000
242368,242368,"Frami, Anderson and Donnelly",182 Bertie Road,East Davian,Iowa,72686,162000,120000,35000
268755,268755,Walsh-Haley,2624 Beatty Parkways,Goodwinmouth,RhodeIsland,31919,55000,120000,35000
273274,273274,McDermott PLC,8917 Bergstrom Meadow,Kathryneborough,Delaware,27933,150000,120000,70000

In [41]:
del df['account']

In [42]:
df.shape

(15, 8)

In [43]:
df

,name,street,city,state,postal-code,Jan,Feb,Mar
account,,,,,,,,
211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
109996,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
121213,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000
132971,"Williamson, Schumm and Hettinger",89403 Casimer Spring,Jeremieburgh,Arkansas,62785,150000,120000,35000
145068,Casper LLC,340 Consuela Bridge Apt. 400,Lake Gabriellaton,Mississipi,18008,62000,120000,70000
205217,Kovacek-Johnston,91971 Cronin Vista Suite 601,Deronville,RhodeIsland,53461,145000,95000,35000
209744,Champlin-Morar,26739 Grant Lock,Lake Juliannton,Pennsylvania,64415,70000,95000,35000
212303,Gerhold-Maggio,366 Maggio Grove Apt. 998,North Ras,Idaho,46308,70000,120000,35000
214098,"Goodwin, Homenick and Jerde",649 Cierra Forks Apt. 078,Rosaberg,Tenessee,47743,45000,120000,55000
231907,Hahn-Moore,18115 Olivine Throughway,Norbertomouth,NorthDakota,31415,150000,10000,162000
242368,"Frami, Anderson and Donnelly",182 Bertie Road,East Davian,Iowa,72686,162000,120000,35000
268755,Walsh-Haley,2624 Beatty Parkways,Goodwinmouth,RhodeIsland,31919,55000,120000,35000
273274,McDermott PLC,8917 Bergstrom Meadow,Kathryneborough,Delaware,27933,150000,120000,70000

In [44]:
# column과 index number
df[['name', 'street']][:2]

                               name              street
account
211829   Kerluke, Koepp and Hilpert  34456 Sean Highway
320563               Walter-Trantow   1311 Alvis Tunnel

In [45]:
df[['name', 'street']].iloc[:2]

                               name              street
account
211829   Kerluke, Koepp and Hilpert  34456 Sean Highway
320563               Walter-Trantow   1311 Alvis Tunnel

In [46]:
# column number와 index number
df.iloc[:2, :2]

                               name              street
account
211829   Kerluke, Koepp and Hilpert  34456 Sean Highway
320563               Walter-Trantow   1311 Alvis Tunnel

In [47]:
# column과 index number
df.loc[[211829, 320563], ['name', 'street']]

                               name              street
account
211829   Kerluke, Koepp and Hilpert  34456 Sean Highway
320563               Walter-Trantow   1311 Alvis Tunnel

In [48]:
df.index = list(range(15))

In [49]:
# Data drop, axis가 지정한 축을 기준으로 drop, defalut : 0
df.drop("city", axis = 1)

,name,street,state,postal-code,Jan,Feb,Mar
0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,Texas,28752,10000,62000,35000
1,Walter-Trantow,1311 Alvis Tunnel,NorthCarolina,38365,95000,45000,35000
2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,Iowa,76517,91000,120000,35000
3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Maine,46021,45000,120000,10000
4,Bauch-Goldner,7274 Marissa Common,California,49681,162000,120000,35000
5,"Williamson, Schumm and Hettinger",89403 Casimer Spring,Arkansas,62785,150000,120000,35000
6,Casper LLC,340 Consuela Bridge Apt. 400,Mississipi,18008,62000,120000,70000
7,Kovacek-Johnston,91971 Cronin Vista Suite 601,RhodeIsland,53461,145000,95000,35000
8,Champlin-Morar,26739 Grant Lock,Pennsylvania,64415,70000,95000,35000
9,Gerhold-Maggio,366 Maggio Grove Apt. 998,Idaho,46308,70000,120000,35000
10,"Goodwin, Homenick and Jerde",649 Cierra Forks Apt. 078,Tenessee,47743,45000,120000,55000
11,Hahn-Moore,18115 Olivine Throughway,NorthDakota,31415,150000,10000,162000
12,"Frami, Anderson and Donnelly",182 Bertie Road,Iowa,72686,162000,120000,35000
13,Walsh-Haley,2624 Beatty Parkways,RhodeIsland,31919,55000,120000,35000
14,McDermott PLC,8917 Bergstrom Meadow,Delaware,27933,150000,120000,70000

## DataFrame Operations

### Series Operations
- same as numpy operations

In [50]:
s1= pd.Series(range(1, 6), index = list('abcde'))
s1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [52]:
s2= pd.Series(range(5, 10), index = list('bcdef'))
s2

b    5
c    6
d    7
e    8
f    9
dtype: int64

In [54]:
# index를 기준으로 연산을 수행한다.
# 같은 index가 없을 경우에는 NaN값으로 출력한다.
s1 + s2

a     NaN
b     7.0
c     9.0
d    11.0
e    13.0
f     NaN
dtype: float64

In [55]:
s1.add(s2)

a     NaN
b     7.0
c     9.0
d    11.0
e    13.0
f     NaN
dtype: float64

In [56]:
#fill_value 인자를 사용해서 NaN값이 안뜨도록 조절가능하다.
s1.add(s2, fill_value = 0)

a     1.0
b     7.0
c     9.0
d    11.0
e    13.0
f     9.0
dtype: float64

### DataFrame Operation

In [62]:
df1 = pd.DataFrame(np.arange(9).reshape(3, 3), columns = list('abc'), dtype = np.float32)
df1

     a    b    c
0  0.0  1.0  2.0
1  3.0  4.0  5.0
2  6.0  7.0  8.0

In [63]:
df2 = pd.DataFrame(np.arange(16).reshape(4,4), columns=list('abcd'), dtype = np.float32)
df2

      a     b     c     d
0   0.0   1.0   2.0   3.0
1   4.0   5.0   6.0   7.0
2   8.0   9.0  10.0  11.0
3  12.0  13.0  14.0  15.0

In [65]:
# 사이즈가 맞지않는 행과 열 부분은 NaN 값으로 들어간다
df1 + df2

      a     b     c   d
0   0.0   2.0   4.0 NaN
1   7.0   9.0  11.0 NaN
2  14.0  16.0  18.0 NaN
3   NaN   NaN   NaN NaN

In [67]:
# add, sub, div, mul
df1.add(df2, fill_value = 0)

      a     b     c     d
0   0.0   2.0   4.0   3.0
1   7.0   9.0  11.0   7.0
2  14.0  16.0  18.0  11.0
3  12.0  13.0  14.0  15.0

### Series + DataFrame

In [72]:
# column을 기준으로 broadcasting이 발생
s = pd.Series(np.arange(10, 14), index = list('abcd'), dtype = np.float32)
s

a    10.0
b    11.0
c    12.0
d    13.0
dtype: float32

In [71]:
df = pd.DataFrame(np.arange(16).reshape(4, 4), columns= list('abcd'), dtype = np.float32)
df

      a     b     c     d
0   0.0   1.0   2.0   3.0
1   4.0   5.0   6.0   7.0
2   8.0   9.0  10.0  11.0
3  12.0  13.0  14.0  15.0

In [73]:
df + s

      a     b     c     d
0  10.0  12.0  14.0  16.0
1  14.0  16.0  18.0  20.0
2  18.0  20.0  22.0  24.0
3  22.0  24.0  26.0  28.0

### Series + DataFrame with axis

In [74]:
s = pd.Series(np.arange(10, 14), dtype = np.float32)
s

0    10.0
1    11.0
2    12.0
3    13.0
dtype: float32

In [75]:
df + s

    a   b   c   d   0   1   2   3
0 NaN NaN NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN NaN NaN

In [76]:
df.add(s, axis = 0) # axis 0 : row, 1 :column

      a     b     c     d
0  10.0  11.0  12.0  13.0
1  15.0  16.0  17.0  18.0
2  20.0  21.0  22.0  23.0
3  25.0  26.0  27.0  28.0

## lambda, map, apply

### lambda 함수
- 한 줄로 함수를 표현하는 익명 함수 기법

In [77]:
f = lambda x : x/2
f(2)

1.0

In [79]:
f = lambda x : x == 3
f(3)

True

In [81]:
# 이름을 할당하지않은 lambda 함수
(lambda x : x ** 3)(23)

12167

### map
- 함수와 sequence형 데이터를 인자로 받아 각 element마다 입력받은 함수를 적용하여 list로 반환
- 일반적으로 함수를 lambda형태로 표현함

In [83]:
# 두 개 이상의 argument가 있을 때는 두 개의 sequence형을 써야한다
ex = [1, 2, 3, 4, 5]
f = lambda x, y : x * y
list(map(f, ex, ex))

[1, 4, 9, 16, 25]

In [84]:
# lambda 함수 그대로 map에 사용할 수 있음
list(map(lambda x : x + x, ex))

[2, 4, 6, 8, 10]

In [85]:
# list() 처리를 하지않으면 결과 값의 주소값이 출력된다.
map(lambda x : x + x, ex)

### map for Series

In [86]:
s1 = pd.Series(np.arange(10))
s1.head()

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [88]:
s1.map(lambda x : x * 2)

0     0
1     2
2     4
3     6
4     8
5    10
6    12
7    14
8    16
9    18
dtype: int64

In [90]:
# dict type으로 같은 index에 존재하는 값을 적절하게 바꾸어준다
# 이때 없는 값은 NaN으로 교체한다.
z = {1 : 'A', 2 : 'B', 3 : 'C'}
s1.map(z).head()

0    NaN
1      A
2      B
3      C
4    NaN
dtype: object